# define FRAME00 "\r\n       يقبدومقبقب                                             \n\r    وممبوسمحميقبدوم                                       🕊️    \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                             "
# define FRAME00_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME01 "\r\n       يقبدومقبقب                                             \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                 🕊️       \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                             "
# define FRAME01_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME02 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                              🕊️       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                             "
# define FRAME02_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME03 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                           🕊️         \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                             "
# define FRAME03_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME04 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                         🕊️            \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                             "
# define FRAME04_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME05 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                        🕊️               \n\r        لطفةششوش                                             "
# define FRAME05_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME06 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                           🕊️                "
# define FRAME06_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME07 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                        🕊️                   "
# define FRAME07_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME08 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                    🕊️                       "
# define FRAME08_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب              "
# define FRAME09 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME09_bis "         \n\r         |    |_🐦              🕊️                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME10 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME10_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯           🕊️                                \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME11 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME11_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯        🕊️                                   \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME12 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME12_bis "         \n\r         |    |_🐦                                             \n\r         {     _/¯     🕊️                                      \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME13 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME13_bis "         \n\r         |    |_🐦  🕊️                                         \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME14 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME14_bis "         \n\r         |    |_🐦🕊️                                           \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME15 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                                  "
# define FRAME15_bis "         \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب         "
# define FRAME16 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش  ❤️                                          "
# define FRAME16_bis "         \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                 \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب        "
# define FRAME17 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                       \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش ❤️                                          "
# define FRAME17_bis "         \n\r         |    |🐦🕊️                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب        "
# define FRAME18 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                       \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                          \n\r        لطفةششوش ❤️❤️                                   "
# define FRAME18_bis "           \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب       "
# define FRAME19 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                           \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش ❤️❤️                                   "
# define FRAME19_bis "           \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب       "
# define FRAME20 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                         \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش ❤️❤️                                   "
# define FRAME20_bis "           \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب       "
# define FRAME21 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                          \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش ❤️❤️❤️                            "
# define FRAME21_bis "            \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب      "
# define FRAME22 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                            \n\r        لطفةششوش ❤️❤️❤️                            "
# define FRAME22_bis "            \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب      "
# define FRAME23 "\r\n       يقبدومقبقب                                              \n\r    وممبوسمحميقبدوم                                            \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                           \n\r    تينياتإيبسومإيبسوم                                       \n\r        لطفةششوش ❤️ ❤️ ❤️                           "
# define FRAME23_bis "            \n\r         |    |🐦🕊️                                            \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب      "

#include <stdio.h>
#include <stdlib.h>

void print_modif(const char *original, const char *final, char *frame_name)
{
	int changed = 0;
	size_t i = 0;
	while (final[i])
	{
		if (original[i] != final[i])
		{
			if (!changed)
				printf("\t");
			printf("%s[%ld] = (unsigned char)%u; ",frame_name, i, (unsigned char)(final[i]));
			changed = 1;
		}
		++i;
	}
	printf("\t%s[%ld] = 0;\n",frame_name, i);
	// printf("printf(\"%%s\\n\", frame);\n");
}



void do_modif(char *frame);
void print_modif_to_do(void);
void print_sizeof_str(void);

int main()
{
	char frame[]="\r\n       يقبدومقبقب                                             \n\r    وممبوسمحميقبدوم                                       🕊️    \n\r  كحوللحروفلعيةىروممكن                                         \n\r هموعيسمحتكستهوولموعيسمح                                       \n\r بريميرولافدميدكومبوزلعربي                                      \n\r   بةمفهومةمنقبلاغلببرامج                                       \n\r    تينياتإيبسومإيبسوم                                         \n\r        لطفةششوش                                               \n\r         |    |_🐦                                             \n\r         {     _/¯                                             \n\r         |    /                                                \n\r         |    |                                                \n\r         |  @ |                                                \n\r         |    {                                                \n\r        /      \\           🌸                 🌸 🌻        🌼  \n\rبننطيننيننيمنطبطيبميبميبميبميننيننيطنيننيبميبمي\\  ^     /ميبننيب";
	// print_modif_to_do();
	// do_modif(frame);
	print_sizeof_str();

	return 0;
}

void print_modif_to_do(void)
{
	char string_name[] = "frame";
	char string_name_bis[] = "frame_bis";

	print_modif(FRAME00, FRAME01, string_name);
	print_modif(FRAME00_bis, FRAME01_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME01, FRAME02, string_name);
	print_modif(FRAME01_bis, FRAME02_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME02, FRAME03, string_name);
	print_modif(FRAME02_bis, FRAME03_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME03, FRAME04, string_name);
	print_modif(FRAME03_bis, FRAME04_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME04, FRAME05, string_name);
	print_modif(FRAME04_bis, FRAME05_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME05, FRAME06, string_name);
	print_modif(FRAME05_bis, FRAME06_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME06, FRAME07, string_name);
	print_modif(FRAME06_bis, FRAME07_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME07, FRAME08, string_name);
	print_modif(FRAME07_bis, FRAME08_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME08, FRAME09, string_name);
	print_modif(FRAME08_bis, FRAME09_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME09, FRAME10, string_name);
	print_modif(FRAME09_bis, FRAME10_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME10, FRAME11, string_name);
	print_modif(FRAME10_bis, FRAME11_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME11, FRAME12, string_name);
	print_modif(FRAME11_bis, FRAME12_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME12, FRAME13, string_name);
	print_modif(FRAME12_bis, FRAME13_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME13, FRAME14, string_name);
	print_modif(FRAME13_bis, FRAME14_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME14, FRAME15, string_name);
	print_modif(FRAME14_bis, FRAME15_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME15, FRAME16, string_name);
	print_modif(FRAME15_bis, FRAME16_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME16, FRAME17, string_name);
	print_modif(FRAME16_bis, FRAME17_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME17, FRAME18, string_name);
	print_modif(FRAME17_bis, FRAME18_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME18, FRAME19, string_name);
	print_modif(FRAME18_bis, FRAME19_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME19, FRAME20, string_name);
	print_modif(FRAME19_bis, FRAME20_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME20, FRAME21, string_name);
	print_modif(FRAME20_bis, FRAME21_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME21, FRAME22, string_name);
	print_modif(FRAME21_bis, FRAME22_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

	
	print_modif(FRAME22, FRAME23, string_name);
	print_modif(FRAME22_bis, FRAME23_bis, string_name_bis);
	printf("\tdisplay_frame(%s, %s);\n", string_name, string_name_bis);

}



void do_modif(char *frame)
{
	frame[149] = (unsigned char)32; frame[150] = (unsigned char)32; frame[151] = (unsigned char)32; frame[152] = (unsigned char)32; frame[153] = (unsigned char)32; frame[154] = (unsigned char)10; frame[155] = (unsigned char)13; frame[158] = (unsigned char)217; frame[159] = (unsigned char)131; frame[160] = (unsigned char)216; frame[161] = (unsigned char)173; frame[162] = (unsigned char)217; frame[163] = (unsigned char)136; frame[165] = (unsigned char)132; frame[166] = (unsigned char)217; frame[167] = (unsigned char)132; frame[168] = (unsigned char)216; frame[169] = (unsigned char)173; frame[170] = (unsigned char)216; frame[171] = (unsigned char)177; frame[173] = (unsigned char)136; frame[174] = (unsigned char)217; frame[175] = (unsigned char)129; frame[176] = (unsigned char)217; frame[177] = (unsigned char)132; frame[178] = (unsigned char)216; frame[179] = (unsigned char)185; frame[181] = (unsigned char)138; frame[182] = (unsigned char)216; frame[183] = (unsigned char)169; frame[184] = (unsigned char)217; frame[185] = (unsigned char)137; frame[186] = (unsigned char)216; frame[187] = (unsigned char)177; frame[188] = (unsigned char)217; frame[189] = (unsigned char)136; frame[191] = (unsigned char)133; frame[192] = (unsigned char)217; frame[193] = (unsigned char)133; frame[195] = (unsigned char)131; frame[197] = (unsigned char)134; frame[198] = (unsigned char)32; frame[199] = (unsigned char)32; frame[200] = (unsigned char)32; frame[201] = (unsigned char)32; frame[202] = (unsigned char)32; frame[203] = (unsigned char)32; frame[231] = (unsigned char)240; frame[232] = (unsigned char)159; frame[233] = (unsigned char)149; frame[234] = (unsigned char)138; frame[235] = (unsigned char)239; frame[236] = (unsigned char)184; frame[237] = (unsigned char)143; frame[1254] = 0; printf("%s\n", frame);
	frame[74] = (unsigned char)32; frame[75] = (unsigned char)10; frame[76] = (unsigned char)13; frame[80] = (unsigned char)32; frame[81] = (unsigned char)217; frame[82] = (unsigned char)136; frame[83] = (unsigned char)217; frame[84] = (unsigned char)133; frame[85] = (unsigned char)217; frame[86] = (unsigned char)133; frame[87] = (unsigned char)216; frame[88] = (unsigned char)168; frame[89] = (unsigned char)217; frame[90] = (unsigned char)136; frame[91] = (unsigned char)216; frame[92] = (unsigned char)179; frame[93] = (unsigned char)217; frame[94] = (unsigned char)133; frame[95] = (unsigned char)216; frame[96] = (unsigned char)173; frame[97] = (unsigned char)217; frame[98] = (unsigned char)133; frame[99] = (unsigned char)217; frame[100] = (unsigned char)138; frame[101] = (unsigned char)217; frame[102] = (unsigned char)130; frame[103] = (unsigned char)216; frame[104] = (unsigned char)168; frame[105] = (unsigned char)216; frame[106] = (unsigned char)175; frame[107] = (unsigned char)217; frame[108] = (unsigned char)136; frame[109] = (unsigned char)217; frame[110] = (unsigned char)133; frame[154] = (unsigned char)32; frame[155] = (unsigned char)10; frame[156] = (unsigned char)13; frame[158] = (unsigned char)32; frame[159] = (unsigned char)217; frame[160] = (unsigned char)131; frame[161] = (unsigned char)216; frame[162] = (unsigned char)173; frame[163] = (unsigned char)217; frame[164] = (unsigned char)136; frame[165] = (unsigned char)217; frame[166] = (unsigned char)132; frame[167] = (unsigned char)217; frame[168] = (unsigned char)132; frame[169] = (unsigned char)216; frame[170] = (unsigned char)173; frame[171] = (unsigned char)216; frame[172] = (unsigned char)177; frame[173] = (unsigned char)217; frame[174] = (unsigned char)136; frame[175] = (unsigned char)217; frame[176] = (unsigned char)129; frame[177] = (unsigned char)217; frame[178] = (unsigned char)132; frame[179] = (unsigned char)216; frame[180] = (unsigned char)185; frame[181] = (unsigned char)217; frame[182] = (unsigned char)138; frame[183] = (unsigned char)216; frame[184] = (unsigned char)169; frame[185] = (unsigned char)217; frame[186] = (unsigned char)137; frame[187] = (unsigned char)216; frame[188] = (unsigned char)177; frame[189] = (unsigned char)217; frame[190] = (unsigned char)136; frame[191] = (unsigned char)217; frame[192] = (unsigned char)133; frame[193] = (unsigned char)217; frame[194] = (unsigned char)133; frame[195] = (unsigned char)217; frame[196] = (unsigned char)131; frame[197] = (unsigned char)217; frame[198] = (unsigned char)134; frame[231] = (unsigned char)32; frame[232] = (unsigned char)32; frame[233] = (unsigned char)32; frame[234] = (unsigned char)32; frame[235] = (unsigned char)32; frame[236] = (unsigned char)32; frame[237] = (unsigned char)32; frame[240] = (unsigned char)10; frame[241] = (unsigned char)13; frame[243] = (unsigned char)217; frame[244] = (unsigned char)135; frame[245] = (unsigned char)217; frame[246] = (unsigned char)133; frame[247] = (unsigned char)217; frame[248] = (unsigned char)136; frame[249] = (unsigned char)216; frame[250] = (unsigned char)185; frame[251] = (unsigned char)217; frame[252] = (unsigned char)138; frame[253] = (unsigned char)216; frame[254] = (unsigned char)179; frame[255] = (unsigned char)217; frame[256] = (unsigned char)133; frame[257] = (unsigned char)216; frame[258] = (unsigned char)173; frame[259] = (unsigned char)216; frame[260] = (unsigned char)170; frame[261] = (unsigned char)217; frame[262] = (unsigned char)131; frame[263] = (unsigned char)216; frame[264] = (unsigned char)179; frame[265] = (unsigned char)216; frame[266] = (unsigned char)170; frame[267] = (unsigned char)217; frame[268] = (unsigned char)135; frame[269] = (unsigned char)217; frame[270] = (unsigned char)136; frame[271] = (unsigned char)217; frame[272] = (unsigned char)136; frame[273] = (unsigned char)217; frame[274] = (unsigned char)132; frame[275] = (unsigned char)217; frame[276] = (unsigned char)133; frame[277] = (unsigned char)217; frame[278] = (unsigned char)136; frame[279] = (unsigned char)216; frame[280] = (unsigned char)185; frame[281] = (unsigned char)217; frame[282] = (unsigned char)138; frame[283] = (unsigned char)216; frame[284] = (unsigned char)179; frame[285] = (unsigned char)217; frame[286] = (unsigned char)133; frame[287] = (unsigned char)216; frame[288] = (unsigned char)173; frame[289] = (unsigned char)32; frame[290] = (unsigned char)32; frame[291] = (unsigned char)32; frame[292] = (unsigned char)32; frame[293] = (unsigned char)32; frame[319] = (unsigned char)240; frame[320] = (unsigned char)159; frame[321] = (unsigned char)149; frame[322] = (unsigned char)138; frame[323] = (unsigned char)239; frame[324] = (unsigned char)184; frame[325] = (unsigned char)143; frame[1254] = 0; printf("%s\n", frame);
	frame[319] = (unsigned char)32; frame[320] = (unsigned char)32; frame[321] = (unsigned char)32; frame[322] = (unsigned char)32; frame[323] = (unsigned char)32; frame[324] = (unsigned char)32; frame[325] = (unsigned char)32; frame[328] = (unsigned char)10; frame[329] = (unsigned char)13; frame[331] = (unsigned char)216; frame[332] = (unsigned char)168; frame[333] = (unsigned char)216; frame[334] = (unsigned char)177; frame[335] = (unsigned char)217; frame[336] = (unsigned char)138; frame[337] = (unsigned char)217; frame[338] = (unsigned char)133; frame[339] = (unsigned char)217; frame[340] = (unsigned char)138; frame[341] = (unsigned char)216; frame[342] = (unsigned char)177; frame[343] = (unsigned char)217; frame[344] = (unsigned char)136; frame[345] = (unsigned char)217; frame[346] = (unsigned char)132; frame[347] = (unsigned char)216; frame[348] = (unsigned char)167; frame[349] = (unsigned char)217; frame[350] = (unsigned char)129; frame[351] = (unsigned char)216; frame[352] = (unsigned char)175; frame[353] = (unsigned char)217; frame[354] = (unsigned char)133; frame[355] = (unsigned char)217; frame[356] = (unsigned char)138; frame[357] = (unsigned char)216; frame[358] = (unsigned char)175; frame[359] = (unsigned char)217; frame[360] = (unsigned char)131; frame[361] = (unsigned char)217; frame[362] = (unsigned char)136; frame[363] = (unsigned char)217; frame[364] = (unsigned char)133; frame[365] = (unsigned char)216; frame[366] = (unsigned char)168; frame[367] = (unsigned char)217; frame[368] = (unsigned char)136; frame[369] = (unsigned char)216; frame[370] = (unsigned char)178; frame[371] = (unsigned char)217; frame[372] = (unsigned char)132; frame[373] = (unsigned char)216; frame[374] = (unsigned char)185; frame[375] = (unsigned char)216; frame[376] = (unsigned char)177; frame[377] = (unsigned char)216; frame[378] = (unsigned char)168; frame[379] = (unsigned char)217; frame[380] = (unsigned char)138; frame[381] = (unsigned char)32; frame[382] = (unsigned char)32; frame[383] = (unsigned char)32; frame[384] = (unsigned char)32; frame[385] = (unsigned char)32; frame[408] = (unsigned char)240; frame[409] = (unsigned char)159; frame[410] = (unsigned char)149; frame[411] = (unsigned char)138; frame[412] = (unsigned char)239; frame[413] = (unsigned char)184; frame[414] = (unsigned char)143; frame[1254] = 0; printf("%s\n", frame);
}

void print_sizeof_str(void)
{
		printf("FRAME00: %lu\n",sizeof(FRAME00 ));
	printf("FRAME01: %lu\n",sizeof(FRAME01 ));
	printf("FRAME02: %lu\n",sizeof(FRAME02 ));
	printf("FRAME03: %lu\n",sizeof(FRAME03 ));
	printf("FRAME04: %lu\n",sizeof(FRAME04 ));
	printf("FRAME05: %lu\n",sizeof(FRAME05 ));
	printf("FRAME06: %lu\n",sizeof(FRAME06 ));
	printf("FRAME07: %lu\n",sizeof(FRAME07 ));
	printf("FRAME08: %lu\n",sizeof(FRAME08 ));
	printf("FRAME09: %lu\n",sizeof(FRAME09 ));
	printf("FRAME10: %lu\n",sizeof(FRAME10 ));
	printf("FRAME11: %lu\n",sizeof(FRAME11 ));
	printf("FRAME12: %lu\n",sizeof(FRAME12 ));
	printf("FRAME13: %lu\n",sizeof(FRAME13 ));
	printf("FRAME14: %lu\n",sizeof(FRAME14 ));
	printf("FRAME15: %lu\n",sizeof(FRAME15 ));
	printf("FRAME16: %lu\n",sizeof(FRAME16 ));
	printf("FRAME17: %lu\n",sizeof(FRAME17 ));
	printf("FRAME18: %lu\n",sizeof(FRAME18 ));
	printf("FRAME19: %lu\n",sizeof(FRAME19 ));
	printf("FRAME20: %lu\n",sizeof(FRAME20 ));
	printf("FRAME21: %lu\n",sizeof(FRAME21 ));
	printf("FRAME22: %lu\n",sizeof(FRAME22 ));
	printf("FRAME23: %lu\n\n",sizeof(FRAME23 ));

	printf("FRAME00_bis: %lu\n",sizeof(FRAME00_bis));
	printf("FRAME01_bis: %lu\n",sizeof(FRAME01_bis ));
	printf("FRAME02_bis: %lu\n",sizeof(FRAME02_bis ));
	printf("FRAME03_bis: %lu\n",sizeof(FRAME03_bis ));
	printf("FRAME04_bis: %lu\n",sizeof(FRAME04_bis ));
	printf("FRAME05_bis: %lu\n",sizeof(FRAME05_bis ));
	printf("FRAME06_bis: %lu\n",sizeof(FRAME06_bis ));
	printf("FRAME07_bis: %lu\n",sizeof(FRAME07_bis ));
	printf("FRAME08_bis: %lu\n",sizeof(FRAME08_bis ));
	printf("FRAME09_bis: %lu\n",sizeof(FRAME09_bis ));
	printf("FRAME10_bis: %lu\n",sizeof(FRAME10_bis ));
	printf("FRAME11_bis: %lu\n",sizeof(FRAME11_bis ));
	printf("FRAME12_bis: %lu\n",sizeof(FRAME12_bis ));
	printf("FRAME13_bis: %lu\n",sizeof(FRAME13_bis ));
	printf("FRAME14_bis: %lu\n",sizeof(FRAME14_bis ));
	printf("FRAME15_bis: %lu\n",sizeof(FRAME15_bis ));
	printf("FRAME16_bis: %lu\n",sizeof(FRAME16_bis ));
	printf("FRAME17_bis: %lu\n",sizeof(FRAME17_bis ));
	printf("FRAME18_bis: %lu\n",sizeof(FRAME18_bis ));
	printf("FRAME19_bis: %lu\n",sizeof(FRAME19_bis ));
	printf("FRAME20_bis: %lu\n",sizeof(FRAME20_bis ));
	printf("FRAME21_bis: %lu\n",sizeof(FRAME21_bis ));
	printf("FRAME22_bis: %lu\n",sizeof(FRAME22_bis ));
	printf("FRAME23_bis: %lu\n",sizeof(FRAME23_bis ));
}